module.exports = {
  head: [
    [
      "script",
      {},
      `
     var _hmt = _hmt || [];
     (function() {
       var hm = document.createElement("script");
       hm.src = "https://hm.baidu.com/hm.js?73d5a8b04c811a588a4e32f6939f2e41";
       var s = document.getElementsByTagName("script")[0]; 
       s.parentNode.insertBefore(hm, s);
     })();`,
    ],
  ],
  themeConfig: {
    logo: "/assets/img/logo.png",
    nav: [
      { text: "首页", link: "/" },
      { text: "大数据", link: "/大数据/" },
      { text: "Python", link: "/Python/" },
      { text: "前端开发", link: "/前端开发/" },
      { text: "人工智能", link: "/人工智能/" },
      { text: "数据库", link: "/数据库/" },
      { text: "网络安全", link: "/网络安全/" },
      { text: "移动端开发", link: "/移动端开发/" },
      { text: "游戏开发", link: "/游戏开发/" },
      { text: "云计算", link: "/云计算/" },
      { text: "测试", link: "/测试/" },
      { text: "GitHub", link: "https://github.com/xiechuanan/VuePress" },
    ],

    sidebar: {
      "/测试/":["", "Bug修复","Bug报告","UI测试","代码审查","代码覆盖率","功能测试","单元测试","压力测试","变更管理","回归测试","复杂度分析","安全测试","性能测试","持续交付","持续部署","持续集成","探索性测试","接口测试","测试用例设计","测试覆盖率","测试驱动开发","白盒测试","缺陷管理","缺陷跟踪","自动化测试","行为驱动开发","负载测试","集成测试","静态代码分析","黑盒测试"], 
      "/大数据/": ["", "ETL", "Hadoop", "HDFS", "Hive", "MapReduce", "NoSQL", "Pig", "Spark", "Storm", "分布式系统", "基于位置的服务", "多维数据分析", "实时数据", "数据仓库", "数据仓库自动化", "数据可视化", "数据建模", "数据挖掘", "数据架构", "数据治理", "数据流", "数据流处理", "数据清洗", "数据湖", "数据血缘分析", "数据质量", "时间序列分析", "机器学习", "流行度计算", "神经网络"],
      "/前端开发/":["","Ajax","Angular","BOM","CSS","CSS3新特性","DOM","ES6语法","HTML","HTML5新特性","JavaScript","Jquery","JSON","NodeJs","React","RESTful","Vue","Webpack","Web安全","代码规范","前端一站式开发","前端性能优化","前端框架设计模式","前端自动化构建工具","动画效果","协作开发工具","响应式设计","搜索引擎优化","浏览器兼容性","移动端开发工具","移动端适配"],
      "/人工智能/": ["","元学习","分布式学习","半监督学习","半监督强化学习","卷积神经网络","图像识别","增强学习","多任务学习","并行计算","异构计算","强化学习","循环神经网络","推荐算法","数据可视化","数据挖掘","无监督学习","机器学习模型","模型压缩","深度学习","深度强化学习","生成对抗网络","监督学习","目标检测","神经机器翻译","神经网络","联邦学习","自然语言处理","自适应算法","计算机视觉","语音识别","迁移学习"],
      "/数据库/": ["", "主键", "关系型数据库", "索引", "BigData", "Redis", "数据访问控制"],
      "/网络安全/": ["", "DDoS攻击", "SQL注入", "VPN技术", "XSS攻击", "信息安全管理体系", "僵尸网络", "入侵检测", "入侵防御系统", "加密算法", "口令破解", "安全加固", "安全培训", "安全审计", "安全检测", "安全漏洞", "安全策略", "安全管理", "恶意软件", "数字证书", "数据分类保护", "数据备份", "最小权限原则", "漏洞扫描", "病毒", "网络安全法", "网络钓鱼", "身份验证技术", "防火墙", "黑客攻击"],
      "/移动端开发/":["", "Android Studio","API接口","Crash分析","Flutter","Flux","GCD","iOS模拟器","Java","JSON","Kotlin","MVC架构","MVVM架构","Objective-C","React Native","Redux","RunLoop","Swift","UI设计","Xcode","XML","原生应用","堆栈溢出","多点触控","安卓虚拟机","持续集成","混合应用","用户分析","自动化构建","触摸事件","集成测试"],
      "/游戏开发/": ["", "递归渲染", "剪辑动画", "光照遮蔽", "渲染引擎", "材质", "着色器"],
      "/云计算/":["", "云原生","云存储","云安全","云平台","云数据库","云监控","云端应用程序接口","云网络","云计算资源池","公共IP地址","公有云","多租户架构","容器化","密钥管理","对象存储","弹性IP","弹性伸缩","弹性计算","数据加密","数据备份与恢复","服务级别协议","混合云","私有云","私有网络","自动化部署","虚拟专用网","虚拟化","负载均衡","负载均衡器","高可用性"],
      "/Python/":["GUI编程","Web开发","人工智能","元组","函数","列表","判断","协程","变量","多线程编程","多进程编程","字典","字符串处理","异常处理","异步编程","循环","数据分析","文件操作","机器学习","模块","正则表达式","爬虫","生成器","类","网络编程","装饰器","进程间通信","迭代器","闭包","面向对象编程"],
      
      // fallback
      "/": ["about"],
    },
  },
};
